#Задача 2: Конвертор на валути

BGN = float(input("Въведете стойност в лв.: "))
currency = str(input("Изберете валута за конвертиране (eur, usd, ron): "))

if currency == "eur":
    print(f"Обменния курс на лв. към Евро е: {(BGN * 1.95583):.2f}")
elif currency == "usd":
    print(f"Обменния курс на лв. към Американски долари е: {(BGN * 0.593711):.2f}")
elif currency == "ron":
    print(f"Обменния курс на лв. към Румънски лей е: {(BGN * 2.5991):.2f}")
else:
    print("Грешен/Неподдържан тип валута!")