#Задача 3: Конвертор на температура от Целзий във Фаренхайт

temp_C = float(input("Въведете температура в Целзий (°C): "))
#°F = (°C x 1.8) + 32
temp_F = (temp_C * (9/5)) + 32
print (f"Температурата във Фаренхайт: {temp_F} °F")