'''
Задача 8: Изчисляване на количеството гориво:
    Напишете програма, която по въведени разстояние в километри и разход на гориво в литри на 100 километра 
    изчислява количеството гориво, необходимо за пътуването.
'''

distance = float(input("Въведете разстоянието в километри: "))
consumption = float(input("Въведете разхода на гориво (литра на 100 км): "))

fuel = (distance * consumption) / 100

print(f"Необходимото количество гориво е: {fuel:.2f} литра.")