#Задача 4: Калкулатор за площ на правоъгълен триъгълник

a = float(input("Въведете дължината на катета: "))
b = float(input("Въведете дължината на катета: "))

Area = (a * b) / 2

print(f"Лицето на Правоъгълния триъгълник е: {Area} м.ед^2")