#Задача 10. Създайте програма, която извежда четните числа и пропуска нечетните числа в диапазона от 2 до 20.
for i in range(2, 21):
    if i % 2 == 0:
        print(i)