#Задача 9. Напишете програма, която да брои колко цифри има в дадено цяло число, въведено от потребителя. Програмата трябва да изведе броя на цифрите в числото.

n = input("Enter a number: ")
print("Number of digits:", len(n))