#Задача 12. Създайте програма с помощта на while цикъл, която извежда числата от 1 до 10, но пропуска числата, 
#           които са делители на 3 и спира изпълението, ако стигнем число, което е делител на 5.
i = 1

while i <= 10:
    # ако е делител на 5 -> прекратяваме програмата
    if i % 5 == 0:
        print(f"Срещнато е число делител на 5 ({i}). Програмата спира.")
        break

    # ако е делител на 3 -> пропускаме и не печатаме
    if i % 3 == 0:
        i += 1
    print(i)
    i += 1
