#Задача 7: Калкулатор за ДДС: Напишете програма, която по въведена цена на стока и ставка на ДДС изчислява сумата на ДДС и общата цена.

price = float(input("Въведете нетната цена на продукт(а): "))
vat_rate = int(input("Въведете процентът на ДДС-то (например: 9, 20, т.н.): "))

vat_amount = price * (vat_rate / 100)
total = price + vat_amount

print(f"Стойността на ДДС-то е: {vat_amount:.2f} лв.")
print(f"Брутната цена на продукта е: {total} лв.")