#Задача 1: Пресмятане на средната стойност на 3 числа, въведени от потребителя.
#Средно аритметично число

num_1 = float(input("Въведете (първо) число: "))
num_2 = float(input("Въведете (второ) число: "))
num_3 = float(input("Въведете последно (трето) число: "))
avarage_sum = (num_1 + num_2 + num_3) / 3
print (f"Средно аритметичната стойност на въведените числа е: {avarage_sum}")