#Задача 5: Конвертор на дължина от инчове в сантиметри

inch = float(input("Въведете дължина в Инчове: "))

conv_to_cm = inch * 2.54
print(f"Дължината в сантиметри е: {conv_to_cm} cm.")