#Задача 6: Калкулатор за деление с извеждане на остатък

a = float(input("Въведете число (делимо): "))
b = float(input("Въведете число (делител): "))

print (f"Остатъкът от частното на двете числа е: {a % b}")